# 一、for循环作业（看不到截图的同学可以看ppt 39页）
# 1：输出99乘法表
# 2：经典冒泡排序利用for循环，完成a=[1,7,4,89,34,2]的冒泡排序。
#      冒泡排序：小的排前面，大的排后面
# 3：有1,2,3,4这四个数字，能组成多少个互不相同且五重复数字的三个数？分别是什么？
# 提示，数字xyz,要求，x!=y!=z
# 4：请用嵌套for循环输入如下直角三角形
# 5：请用嵌套for循环输出如下等边三角形（三个边均是5个*）
#
# 二、for range作业
# 1：利用for循环和range找出 0 ~ 100 以内所有的偶数，并追加到一个列表。
# 	2：利用for循环和range 找出 0 ~ 50 以内能被3整除的数，并追加到一个列表。
# 	3：利用for循环和range 找出 0 ~ 50 以内能被3整除的数，并插入到列表的第0个索引位置，
# 	最终结果如下：
# 		[48,45,42...]
# 	4：查找列表li中的元素，移除每个元素的空格，并找出以”a”开头，并添加到一个新列表中,
# 	最后循环打印这个新列表。
# 		li = ["alexC", "AbC ", "egon", " riTiAn", "WuSir", "  aqc"]