# 一、if判断练习题
# 1、根据你输入的数据，来进行判断学生的成绩，输入数据函数：input()
# 2、一家商场在降价促销，如果购买金额50-100元（包含50和100元）之间，会给10%的折扣，
# 如果购买金额大于100元会给20%的折扣，
# 编写一程序，询问购买价格，再显示出折扣（10%或20%）和最终价格
# 3、输入一个数，判断一个数n能同时被3和5整除
# 4、输入一个年份，输出是否为闰年。
# 闰年条件：能被4整除但不能被100整除，或者能被400整除的年份都是闰年
# 5、一个5位数，判断它是不是回文数，（12321就是回文数），
# 个位与万位相同，十位与千位相同，根据判断打印出相关信息
# 6、利用random函数生成随机整数，从1-9取出来。
# 然后输入一个数字，来猜输入的数与随机数的大小，
# 如果大于则打印bigger，如果小于则打印less，如果相等，则打印equal
# 提示：导入random---> import random
#           生成随机数 --->num=random.randint(1,100)
# 二、while循环作业
# 1、利用while循环，让其内部的执行语句只循环5次
# 2、完成1-10之间整数数字相加的和，并打印出最后的结果
# 3、一个足球队在寻找年龄在10-12岁的小女孩（包括10岁和12岁）加入，编写一个程序，询问用户的性别（m表示男性，f表示女性）和年龄，然后显示一条消息指出这个人是否可以加入球队，询问10次后，输出满足条件的总人数。